Documents/ЗагрузкаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ЗагрузкаДанных</Name>
			<Comment>Трейд Софт</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ХранилищеДанныхТабличныхДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаЗначений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолговыхОбязательств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДолговыхОбязательств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправочникиЗаписаны</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретНаРедактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьРанееЗаписанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставитьВОчередь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриниматьУбиратьИзРаботыОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКредиторов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольИД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольКА</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольКР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПозицииРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Comment>Длина</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Положение</Name>
							<Comment>номер начального символа в строке</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыборСоответствий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДанных</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрыСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СправочникВладелец</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСведенияИРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНазначенийСвойств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОчередьФоновыхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОчередьФоновыхЗаданий</Name>
			<Comment>Трейд Софт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентЗавершенности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДобавленияВРегистр</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗадания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыФоновыхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючФоновойЗадачи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправкиНаВыполнение</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаНаДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗагрузкаДанныхДолжника</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СообщенияПоЗагрузкеДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СообщенияПоЗагрузкеДанных</Name>
			<Comment>Трейд Софт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МассивСообщений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗагрузкаДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗагрузкаДанныхДолжника</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыФоновыхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыФоновыхЗаданий</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗагружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Загружено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗагрузкаДанных/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    Если ЭтотОбъект.ЗапретНаРедактирование Тогда
        Отказ = Истина;
    ИначеЕсли ЭтотОбъект.ПоставитьВОчередь Тогда
        Если ЗаписатьСправочникиВФоне() Тогда    
            ЭтотОбъект.ЗапретНаРедактирование = Истина;
            Записать(РежимЗаписиДокумента.Запись);
        Иначе
            Отказ = Истина;
        КонецЕсли;
    Иначе
        Если ЗаписатьДолжниковНаСервере(ЭтотОбъект.ВыводитьСообщения) Тогда
            ЭтотОбъект.ЗапретНаРедактирование = Истина;
            ЭтотОбъект.СправочникиЗаписаны = Истина;
            Записать(РежимЗаписиДокумента.Запись);
        Иначе
            Отказ = Истина;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

// Получает значение реквизита хранилища "ТаблицаЗначений"
//
Функция ВернутьСодержимоеХранилищаТЗДанных() Экспорт
 	Возврат ТаблицаЗначений.Получить();	
КонецФункции

Процедура ЗаписатьСодержимоеХранилищаТЗДанных(ЗаписываемаяТаблица) Экспорт
	Хранилище = Новый ХранилищеЗначения(ЗаписываемаяТаблица, Новый СжатиеДанных(5));	
	ТаблицаЗначений = Хранилище;
КонецПроцедуры


Функция ЗаписатьСправочникиВФоне()
	тзДанные = ВернутьСодержимоеХранилищаТЗДанных();	
	Если тзДанные.Количество() = 0 Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	//Проверка на заполнение обязательных полей
	ОбязательныеРеквизитыТЧ = Новый Массив();
	ОбязательныеРеквизитыТЧ.Добавить("Наименование");
	ОбязательныеРеквизитыТЧ.Добавить("Идентификатор");
	Если Константы.УчетПоДО.Получить() И ЭтотОбъект.КонтрольДО Тогда
		ОбязательныеРеквизитыТЧ.Добавить("НомерДО");
	КонецЕсли;
	Если ЭтотОбъект.КонтрольД Тогда
		ОбязательныеРеквизитыТЧ.Добавить("ИдентификаторД");
	КонецЕсли;
	Если ЭтотОбъект.КонтрольИД Тогда
		ОбязательныеРеквизитыТЧ.Добавить("ИдентификаторИД");
	КонецЕсли;
	Если ЭтотОбъект.КонтрольУ Тогда
		ОбязательныеРеквизитыТЧ.Добавить("ИдентификаторУ");
	КонецЕсли;
	Если ЭтотОбъект.КонтрольКА Тогда
		ОбязательныеРеквизитыТЧ.Добавить("ИдентификаторКА");
	КонецЕсли;
	Если ЭтотОбъект.КонтрольКР Тогда
		ОбязательныеРеквизитыТЧ.Добавить("ИдентификаторКР");
	КонецЕсли;

	

	Если НЕ РаботаСДокументами.ПроверитьЗаполнениеТабличнойЧасти(тзДанные, ОбязательныеРеквизитыТЧ) Тогда
		Возврат Ложь;
	КонецЕсли;	
	ЭтотОбъект.ЗапретНаРедактирование = Истина;
		
	Запись = РегистрыСведений.ОчередьФоновыхЗаданий.СоздатьМенеджерЗаписи(); 
	Запись.СсылкаНаДокумент = ЭтотОбъект.Ссылка;
	Запись.ДатаДобавленияВРегистр = ТекущаяДата();
	Запись.СтатусЗадания = Перечисления.СтатусыФоновыхЗаданий.ВОчереди;
	Попытка
		Запись.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
КонецФункции

Функция ЗаписатьДолжниковНаСервере(ЧислоСообщений)
	тзДанные = ВернутьСодержимоеХранилищаТЗДанных();
	Если тзДанные.Количество() = 0 Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	//Проверка на заполнение обязательных полей
	ОбязательныеРеквизитыТЧ = Новый Массив();
	ОбязательныеРеквизитыТЧ.Добавить("Наименование");
	ОбязательныеРеквизитыТЧ.Добавить("Идентификатор");
	Если Константы.УчетПоДО.Получить() И ЭтотОбъект.КонтрольДО Тогда
		ОбязательныеРеквизитыТЧ.Добавить("НомерДО");
	КонецЕсли;
	Если ЭтотОбъект.ЮрФизЛица.Пустая() Тогда
		ОбязательныеРеквизитыТЧ.Добавить("ТипДОЛ");
	КонецЕсли;
	Если ЭтотОбъект.ТипДолговыхОбязательств.Пустая() Тогда
		ОбязательныеРеквизитыТЧ.Добавить("ТипДО");
	КонецЕсли;
	Если ЭтотОбъект.КонтрольД Тогда
		ОбязательныеРеквизитыТЧ.Добавить("ИдентификаторД");
	КонецЕсли;
	Если ЭтотОбъект.КонтрольИД Тогда
		ОбязательныеРеквизитыТЧ.Добавить("ИдентификаторИД");
	КонецЕсли;
	Если ЭтотОбъект.КонтрольУ Тогда
		ОбязательныеРеквизитыТЧ.Добавить("ИдентификаторУ");
	КонецЕсли;
	Если ЭтотОбъект.КонтрольКА Тогда
		ОбязательныеРеквизитыТЧ.Добавить("ИдентификаторКА");
	КонецЕсли;
	Если ЭтотОбъект.КонтрольКР Тогда
		ОбязательныеРеквизитыТЧ.Добавить("ИдентификаторКР");
	КонецЕсли;

	Если НЕ РаботаСДокументами.ПроверитьЗаполнениеТабличнойЧасти(тзДанные, ОбязательныеРеквизитыТЧ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не Константы.УчетПоДО.Получить() ИЛИ Не ЭтотОбъект.КонтрольДО Тогда
		СоздаватьДО = Ложь;
	Иначе
		СоздаватьДО = Истина;
	КонецЕсли;
	
	//Массив основных реквизитов
	Массив = Новый Массив;
	Массив.Добавить("НомерСтроки");	
	Массив.Добавить("Наименование");
	Массив.Добавить("Идентификатор");
	Массив.Добавить("ИдентификаторКА");
	Массив.Добавить("ИдентификаторКР");
	Если Константы.УчетПоУслугам.Получить() Тогда
		Массив.Добавить("ИдентификаторУ");
	КонецЕсли;
	Если Константы.УчетПоИД.Получить() Тогда
		Массив.Добавить("ИдентификаторИД");
	КонецЕсли;
	Если Константы.УчетПоДоговорам.Получить() Тогда
		Массив.Добавить("ИдентификаторД");
	КонецЕсли;
	
	Массив.Добавить("ВалютаДоговора");
	Массив.Добавить("НомерДО");
	Массив.Добавить("СсылкаДО");
	Массив.Добавить("ТипДОЛ");
	Массив.Добавить("ТипКА");
	Массив.Добавить("ТипКР");
	Массив.Добавить("ТипДО");	
	МассивСообщений = Новый Массив;
	
	МассивДопРеквизитов = Новый Массив;

	Если тзДанные.Колонки.Найти("СсылкаДО") = Неопределено Тогда
		тзДанные.Колонки.Объект.Имя = "СсылкаДО";
	КонецЕсли;	
	
	Для Каждого Колонка Из тзДанные.Колонки Цикл
		//Заполнение Свойств:
		Если Массив.Найти(Колонка.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		КодСвойства = СтрЗаменить(Сред(Колонка.Имя, 2), "_", " ");
		Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду(КодСвойства);
		МассивДопРеквизитов.Добавить(Свойство);
	КонецЦикла;
	
		
	ч = 0;
	Для Каждого ТекСтрока Из тзДанные Цикл
		//Нов
		//Должник = Справочники.Контрагенты.ПустаяСсылка();
		ч = ч + 1;
		Если ч <= ЧислоСообщений Тогда
			ВыводитьСообщения1 = Истина;
		Иначе
			ВыводитьСообщения1 = Ложь;
		КонецЕсли;
		ТекСтрока.СсылкаДО = ФоновыеЗаданияМодуль.ЗаписатьДолжникаИДолговоеОбязательство(Массив, ТекСтрока, тзДанные, ЭтотОбъект.ЮрФизЛица, ЭтотОбъект.ТипКонтрагентов, ЭтотОбъект.ТипКредиторов, ЭтотОбъект.ТипДолговыхОбязательств,
				ЭтотОбъект.ОбновлятьРанееЗаписанные, МассивСообщений, ЭтотОбъект.Ссылка, МассивДопРеквизитов, ВыводитьСообщения1, СоздаватьДО);
	КонецЦикла;
	Если СоздаватьДО Тогда		
		Если Не ФоновыеЗаданияМодуль.СоздатьНаборДокументов(тзДанные, Ссылка) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	ЗаписатьСодержимоеХранилищаТЗДанных(тзДанные);
	
	Если МассивСообщений.Количество() = 0 Тогда
		МассивСообщений.Добавить(Новый Структура("Текст, Объект, Поле, Путь",
				"Все справочники записаны!", ЭтотОбъект.Ссылка, Неопределено, Неопределено));
	КонецЕсли;
	Запись = РегистрыСведений.СообщенияПоЗагрузкеДанных.СоздатьМенеджерЗаписи();
	Запись.Документ = ЭтотОбъект.Ссылка;	
	Запись.МассивСообщений = Новый ХранилищеЗначения(МассивСообщений, Новый СжатиеДанных(5));
	Запись.Записать();
	
	Возврат Истина;		
КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ)
	Отказ = Истина;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	Дата = ТекущаяДата();
КонецПроцедуры
